<?PHP
    /*
     | Submail message/send API demo
     | SUBMAIL SDK Version 2.6 --PHP
     | copyright 2011 - 2017 SUBMAIL
     |--------------------------------------------------------------------------
     */

    /*
     |载入 app_config 文件
     |--------------------------------------------------------------------------
     */
    require '../app_config.php';

    /*
     |载入 SUBMAILAutoload 文件
     |--------------------------------------------------------------------------
     */

    require_once('../SUBMAILAutoload.php');

    /*
     |初始化 MESSAGEXsend 类
     |--------------------------------------------------------------------------
     */

    $submail=new MESSAGEXsend($message_configs);

    /*
     |必选参数
     |--------------------------------------------------------------------------
     |设置短信接收的11位手机号码
     |设置短信模版代码
     |设置短信参数
     |--------------------------------------------------------------------------
     */
    $submail->setTo($_POST['tel']);
    $submail->SetProject("pzi092");
    $submail->AddVar("username",$_POST['username']);
    $submail->AddVar("asset",$_POST['asset']);
    $submail->AddVar("address",$_POST['address']);

    /*
     |调用 send 方法发送短信
     |--------------------------------------------------------------------------
     */

    $xsend=$submail->xsend();

    /*
     |打印服务器返回值
     |--------------------------------------------------------------------------
     */

    print_r($xsend);
